package com.example.pcbuilder.dto;

/**
 * Об'єкт передачі даних (DTO) для представлення запиту на збірку ПК.
 * Цей клас містить ідентифікатори компонентів, вибраних користувачем для збірки ПК.
 */
public class BuildRequest {
    /**
     * Ідентифікатор вибраного процесора (CPU).
     */
    public Long CPU;
    /**
     * Ідентифікатор вибраної відеокарти (GPU).
     */
    public Long GPU;
    /**
     * Ідентифікатор вибраної оперативної пам'яті (RAM).
     */
    public Long RAM;
    /**
     * Ідентифікатор вибраного пристрою зберігання даних (наприклад, SSD, HDD).
     */
    public Long STORAGE;
    /**
     * Ідентифікатор вибраної материнської плати.
     */
    public Long MOTHERBOARD;
    /**
     * Ідентифікатор вибраного блоку живлення (PSU).
     */
    public Long PSU;
    /**
     * Ідентифікатор вибраного корпусу ПК.
     */
    public Long CASE;
}