package com.example.pcbuilder.dto;

/**
 * Об'єкт передачі даних (DTO) для отримання запиту на збірку ПК від клієнта.
 * Цей клас містить унікальні ідентифікатори (ID) для кожного компонента, вибраного користувачем
 * для побудови персонального комп'ютера.
 */
public class BuildRequest {
    /**
     * ID вибраного Центрального Процесорного Пристрою (CPU).
     */
    public Long CPU;

    /**
     * ID вибраного Графічного Процесорного Пристрою (GPU).
     */
    public Long GPU;

    /**
     * ID вибраної Оперативної Пам'яті (RAM).
     */
    public Long RAM;

    /**
     * ID вибраного пристрою зберігання даних (наприклад, SSD, HDD).
     */
    public Long STORAGE;

    /**
     * ID вибраної Материнської Плати.
     */
    public Long MOTHERBOARD;

    /**
     * ID вибраного Блоку Живлення (PSU).
     */
    public Long PSU;

    /**
     * ID вибраного Корпусу ПК.
     */
    public Long CASE;
}